app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]