app/controllers/users_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @user = Book.find(params[:id])